Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ ཇི་ལྟ ར་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ མི་ རྣམས་ ལ་ སྔ་མ་ བཞིན་ དུ་ པད་མ་ དང་ །_ རྟག་ ཏུ་ མེ་ཏོག་ རྒྱས་པ་ དང་ །_ རྟག་ ཏུ་ དྲི་ཞིམ་པ་ དང་ །_ མཆོག་ ཏུ་ ཉམས་ དགའ་བ་ དག་ ཡིན་ ཏེ
en: As he applies knowledge derived from hearing, he will notice how, as mentioned before, the people of Kuru in the north enjoy lotuses, blooming flowers, fragrant flowers, and many other exquisite pleasures.

source: དེ་དག་ མཐོང་ ནས་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ མི་ རྣམས་ འགྲངས་པ་ དང་ །_ དགའ་བ ར་ འགྱུར་ རོ །_།
en: Seeing such things satisfies and delights the people of Kuru.

source: གང་ གི་ ཚེ་ དགེ་སྦྱོང་ དུ་ མི་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ མི་ འཛིན་པ འི་ སྐྱེ་དགུ་ དག་ འབྱུང་བ་ དེ འི་ ཚེ །_ ཀླུ་ མ་རུངས་པ་ དག་ གིས་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ དུ་སྤྲིན་ སྟུག་པོ་ རི་ ལྟ་བུ་ དག་ འབྱིན་པ ར་ བྱེད་ དེ དེ་དག་ བྱུང་ མ་ ཐག་ ཏུ་ ཉི་མ་ སྒྲིབ་པ ར་ བྱེད་ དོ །_།
en: However, whenever people who do not respect mendicants or brahmins show up, the hostile nāgas will create thick clouds on the northern continent of Kuru, and those clouds will obscure the sun.

source: དེས་ བསྒྲིབས་པ འི་ སྐྱོན་ གྱིས་ པད་མ་ དག་ ཞུམ་པ ར་ འགྱུར་ ཞིང་ དྲི་ མི་ ཞིམ་པ ར་ འགྱུར་ ལ་ ཉི་མ་ བཞིན་ དུ་ གསལ་ [6b] བར་མི་ འགྱུར་ རོ །_།
en: As the clouds cover the sun, the lotuses will wither, their smell will become unpleasant, and the flowers will disappear from sight, just like the sun. [6.b]

source: དེ་དག་ ཞུམ་པ་ ཙམ་ གྱིས་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ མི་ རྣམས་ ཡིད་ དམན་པ ར་ འགྱུར་ རོ །_། སྤྲིན་ དང་ རླུང་ ཡང་ གཏོང་བ ར་ བྱེད་ ལ་ དེས་ པི་ བང་ དང་ །_ རྫ་རྔ་ རྣམས་ ཀྱི་ སྒྲ་ མི་ སྙན་པ ར་ འགྱུར་ ཏེ །_
en: When the flowers fade, the minds of the people of Kuru in the north will become gloomy, and the clouds and winds will make the sound of their lutes and clay drums seem unpleasant.

source: དེ་ལྟ ར་ མི འི་ གནས་ བཞི་ ལ་ ཀླུ་ རྣམས་ བར་ཆད་ བྱེད་པ་ མཐོང་ ངོ་ །_།
en: Thus, the monk will see how the nāgas can create obstacles in all four realms of human beings.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ གླིང་བཞི འི་ ནང་ ན་ བཟང་བ་ དང་ །_ བཟང་བ་ མ་ཡིན་པ་ དག་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $56 “Next, the monk who has knowledge of the effects of the ripening of karmic action will consider the four continents in terms of their positive and negative attributes.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གང་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ ནི་ བདེ་བ་ མངོན་དུ་ ཆེ་བ་ ཡིན་ ལ །_ མི འི་ གནས་ གསུམ་ དག་ ནི་ མ་ ཡིན་ ནོ །_།
en: Thus, with knowledge derived from hearing, he will see that while there is tremendous happiness in Kuru in the north, this not so in the other three human realms.

source: འཛམ་བུ འི་ གླིང་ དུ་ ཇི་ལྟ་ ཇི་ལྟ ར་ ཆོས་ དང་ ལྡན་པ་ དང་ །_ ཆོས་ དང་ མི་ ལྡན་པ འི་ སྐྱེ་དགུ་ འབྱུང་བ་ དེ་ལྟ་ དེ་ལྟ ར་ འཕེལ་བ་ དང་ །_ འགྲིབ་པ་ དང་ །_ བདེ་བ་ དང་ །_ སྡུག་བསྔལ་བ་ དག་ ཡོད་ དེ
en: In Jambudvīpa the people may be either righteous or unrighteous, and accordingly there will be both prosperity and decline, happiness and suffering.

source: གླིང་ གསུམ་ གྱི་ ནང་ ན་ འདི་ ནི་ལ ས་ ཀྱིས་ ཡིན་ ནོ །_།
en: Among these three continents, this one manifests according to people’s karmic actions.

source: འདིར་ ནི་ དགེ་བ་ བཅུ འི་ ལས་ ཀྱི་ ལམ་ དག་ སེམས་པ་ ཡིན་ ཞིང་ །_
en: Here people may pay heartfelt respect to the ten virtuous actions.

source: འདིར་ ནི་ སངས་རྒྱས་ འབྱུང་བ་ ཡིན་ ལ །_
en: Here buddhas appear.

source: འདིར་ ནི་ མི འི་ གནས་ བཞི་ དག་ གི་ རག་ ལས་པ་ ཡིན་ ཏེ
en: Here one depends on the four human abodes.

source: འདིར་ ནི་ དགེ་བ་ བཅུ འི་ ལས་ ཀྱི་ ལམ་ དག་ ངེས་པ ར་ སེམས་ ཤིང་ རྣམ་པར་ དཔྱོད་པ་ ཡིན །_
en: Here people can consider and examine the ten virtuous actions.

source: འདིར་ ནི་ ཚངས་པ ར་ སྤྱོད་པ འི་ གནས་ ཡིན །_
en: Here pure conduct is practiced.

source: འདིར་ ནི་ འཆི་བ་ དང་ སྐྱེ་བ་ སེམས་པ་ ཡིན །_
en: Here people are mindful of death and birth.

source: འདིར་ ནི་ རྡོ་རྗེ་ ལས་ བྱས་པ འི་ རྡོ་རྗེ འི་ གདན་ ཡོད་ དེ །_
en: Here the Vajra Seat is made of vajra.

source: གང་ འཛམ་བུ འི་ གླིང་ དུ་ དཔག་ཚད་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ འབིགས་པ་ འཁོར་བ་ ཐམས་ཅད་ ན་ མེད་ ལ་ རྡོ་རྗེ འི་ གདན་ ཟིལ་ གྱིས་ གནོན་པ་ ཡང་ མེད་ དེ །_
en: Even if all of cyclic existence within a distance of eighty-four thousand leagues from Jambudvīpa were destroyed and disappeared, the Vajra Seat would endure and could not be demolished.

source: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ གང་ ལ་ གནས་ ནས་ བྱང་ཆུབ་ ཏུ་ ཐུགས་བསྐྱེད་པ འི་ རྒྱུ་ འདི ས་ ན་ འཛམ་བུ འི་ གླིང་ འདིར་ འཁྲུངས་ ཏེ །_
en: Since the very cause for them to set their minds on awakening is found here, the blessed buddhas take birth in Jambudvīpa.

source: རྒྱུ་ གང་ དང་ བྱང་ཆུབ་ ཐོབ་པ ར་ བྱེད་པ་ དགེ་བ འི་ རྩ་བ འི་ གྲངས་ ཀྱི་ རྒྱུན་ གང་ཡིན་པ་ དེ་ ནི་ རི འི་ རྒྱལ་པོ་ རི་རབ་ ཀྱིས་ ཀྱང་ ཡང་དག་ པར་ གཟུང་བ ར་ མི་ ནུས་ ན་ ས་ཕྱོགས་ གཞན་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས །_
en: The number of roots of virtue that cause the attainment of awakening cannot be fathomed, even with the example of Mount Sumeru, so how could anything else within the directions serve as an example?

source: གང་ གིས་ འཛམ་བུ འི་ གླིང་ འདིར་ སངས་རྒྱས་ འབྱུང་བ འི་ རྒྱུ་ ནི་ འདི་ ཡིན་ ཏེ །_
en: The causes for the emergence of buddhas are here.

source: འདིར་ དེ་ གཉའ་ཤིང་ གི་ བུ་ག ར་ རུས་སྦལ་ འཇུག་པ་ ལྟ་བུ ར་ འཁྲུང་ གི _། གླིང་ གཞན་ དུ་ ནི་ མ་ ཡིན་ ཏེ །_
en: Although the causes for the birth of buddhas are as rare as a sea turtle poking its head through a yoke floating on the ocean, they are here and not on any other continent.

source: དེ འི་ རྒྱུ་ ནི་ དེ་ ཡིན་ རྐྱེན་ ནི་ དེ་ ཡིན་ ནོ །_།
en: This is where such causes and conditions lie.

source: གང་ མི འི་ གནས་ བཞི་ [7a] ལ་ ཀུན་ གྱི་ གཙོ་བོ་ ནི་ འཛམ་བུ འི་ གླིང་ འདི་ ཡིན་ ཏེ །_ གླིང་ གཞན་དག་ ནི་ མ་ ཡིན་ ནོ །_།
en: Among all four human abodes, [7.a] Jambudvīpa is the foremost—not any of the others.

source: ལས་ གང་ གིས་ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ དང་ འཐུན་ པར་ མི་ བྱེད་པ་ རྣམས་ སྦལ་པ་ ཟ་བ་ དང་ །_ བྱེ་མ་ ཟ་བ་ དང་ །_ རླུང་ ཟ་བ ར་ འགྱུར་ སྙམ་ ནས
en: ‘What karmic actions will make the unrighteous nāga kings who do not act according to the Dharma eat frogs, sand, or air?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ སྔོན་ མིར་ གྱུར་པ འི་ ཚེ་གང་ གིས་ བུ་ དང་ ཆུང་མ་ རྣམས་ བཀོལ་ ཏེ །_ བཙན་ སྣོགས་ བྱེད་ ལ །_ བུ་སྨད་ ནི་ འགྲམ་ཆུ་ ལངས་ ཏེ །_
en: With knowledge derived from hearing he will then see how, in previous human lives, such nāgas would enslave and rule over#215 their children and wives.

source: རེ་ བཞིན་ དུ་ ལྟ་བ་ དང་ །_ དེ་ བདག་ གཅིག་པུ་ ཟས་ མང་པོ་ ཟ་ ལ །_ བུ་སྨད་ ལ་ ནི་ ཁ་ཟས་ ངན་པ་ སྦྱིན་པ ར་ བྱེད་པ་ ལས །_
en: Thus, with watering mouths, the women would watch while their masters had their main meal alone, while they themselves would only be given inferior food.

source: དེ་ ལུས་ དང་ བྲལ་བ འི་ འོག་ ཏུ་ ཀླུ འི་ སྐྱེ་གནས་ སུ་ སྐྱེ་ ལ་ ཟས་ སུ་ སྦལ་པ་ ཟ་བ་ དང་ །_ བྱེ་མ་ ཟ་བ་ དང་ །_ རླུང་ ཟ་བ་ མཐོང་ སྟེ ལས་ དང་ འདྲ་བ ར་ འབྲས་བུ་ སྨིན་པ འི་ ཕྱིར་ རོ །_།
en: Having separated from their bodies those men are then born in the nāga realm, where they subsist on frogs, sand, or air, because karmic effects ripen in ways that accord with their relevant actions.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ ཀླུ འི་ འཇིག་རྟེན་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_ ལས་ གང་ གིས་ ཀླུ་ དེ་ རྣམས་ ཆར་ འབེབས་པ ར་ བྱེད །_
en: $58 “As the monk who has knowledge of the effects of the ripening of karmic action continues to examine the world of the nāgas, he will ask himself,

source: ལས་ གང་ གིས་ སེར་བ་ འབེབས་པ ར་ བྱེད་ ཅིག་ གུ་ སྙམ་ ནས །_
en: ‘What karmic actions cause the nāgas to bring rain and hail?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གལ་ཏེ་ ཆོས་ དང་ མི་ ལྡན་པ འི་ ཀླུ འི་ རྒྱལ་པོ་ རྣམས་ འཁྲུགས་ ན་ གཅིག་ ལ་ གཅིག་ བསྙོགས་ ཏེ །_ ཁྲོས་པ ས་ ཆར་སྤྲིན་ བསྒྲུབས་ ནས །_ ཆར་ འབེབས་པ ར་ བྱེད་ ཅིང་ གནོད་པ འི་ སྤྲིན་ དང་ རླུང་ དང་ སེར་བ་ དང་ ལྡན་པ འི་ ཆར་དྲག་པོ་ དག་ འབེབས་པ ར་ བྱེད་ ལ །_ དེས་ན་ ཞིང་ ལ་ ནས་ དང་ འབྲས་ དང་ འབྲུ་ ཐམས་ཅད་ མ་ རུང་བ ར་ བྱེད་ དེ དེ་ལྟ ར་ གནོད་པ འི་ ཆར་ འབེབས་པ ར་ བྱེད་པ་ མཐོང་ ངོ་ །_།
en: As he applies knowledge derived from hearing, he will see that when unrighteous nāgas become incensed and angry at each other, they produce harmful rain clouds and rouse fierce rain- and hailstorms that destroy the barley, rice, and other grains in the fields.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ ཀླུ འི་ འཇིག་རྟེན་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $59 “As the monk who has knowledge of the effects of the ripening of karmic action continues to examine the world of the nāgas, he will ask himself,

source: ཀླུ་ རྣམས་ འཛམ་བུ འི་ གླིང་ དུ་ རྙེད་པ་ དང་ ལྡན་པ ར་ བྱ་བ འི་ ཕྱིར་ བུ་རམ་ཤིང་ གི་ ཚལ་ དང་ །_ ཞིང་ ལ་ ནས་ དང་ གྲོ་ དང་ །_ འབྲུ་ རྣམས་ འཕེལ་བ ར་ བྱ་བ འི་ དོན་ དུ་ བདེ་བ ར་ བྱེད་པ འི་ ཆར་ ཇི་ལྟ ར་ འབེབས་པ ར་ བྱེད་ སྙམ་ ནས
en: ‘How do the nāgas create wealth in the human realm by sending delightful rains that nourish sugarcane, barley, wheat, and other grains?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ སེམས་ཅན་ རྣམས་ ཀྱི་ དབང་ གི་ འབྲས་བུ ས་ སྐྱེ་བོ་ ཐམས་ཅད་ ལ་ ཕན་པ་ དང་ བདེ་བ འི་ [7b] ཕྱིར་ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ དང་ འཐུན་ པར་ བྱེད་པ་ རྣམས་ འབྱུང་བ ར་ འགྱུར་ ཏེ དེ་དག་ གིས་ འབྲུ་ མོད་པ ར་ བྱ་བ འི་ ཕྱིར་ ཆར་ འབེབས་པ་ མཐོང་ ངོ་ །_།
en: With knowledge derived from hearing, he will then see that as a determinate effect brought about by sentient beings, [7.b] the righteous nāga kings that follow the Dharma send rains that enrich harvests for the benefit and happiness of all the people.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས །_ ཀླུ འི་ འཇིག་རྟེན་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $60 “As the monk who has knowledge of the effects of the ripening of karmic action continues to examine the world of the nāgas, he will ask himself,

source: རྒྱ་མཚོ་ དང་ རྒྱ་མཚོ འི་ ཆུ་ལག་ དག་ ན །_ ཀླུ་ ཇི་སྙེད་ ཅིག་ གནས་ སྙམ་ ནས །_
en: ‘How many nāgas live in the ocean and the waters of the sea?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གལ་ཏེ་ འཛམ་བུ འི་ གླིང་པ འི་ མི་ རྣམས་ ཕལ་ཆེ ར་ ཆོས་ དང་ མི་ ལྡན་པ ར་ གྱུར་ ན །_ དེ འི་ ཚེ་ ཆོས་ དང་ མི་ ལྡན་པ་ རྣམས་ རྒྱ་མཚོ འི་ ཆུ་ལག་ དག་ ཏུ་ ཀླུ་ གྲངས་མེད་ པར་ སྐྱེ་བ ར་ འགྱུར་ རོ །_། གལ་ཏེ་ ཕལ་ཆེ ར་ ཆོས་ དང་ ལྡན་ ན་ ནི་ ཀླུ་ བྱེ་བ་ ཕྲག་ ལྔ་ བཅུ་ རྩ་ བདུན་ འབྱུང་བ ར་ འགྱུར་ ཏེ །_ དེ་དག་ རྒྱ་མཚོ འི་ ཆུ་ལག་ བཞི་པོ་ དག་ ཏུ་ རྒྱུ་བ ར་ འགྱུར་ རོ །_།
en: As he examines this matter with knowledge derived from hearing, he will see that when most people in Jambudvīpa are unrighteous, countless nāgas will be born at the ocean shores. When most people are righteous, five hundred and seventy million nāgas will appear.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ཀླུ འི་ འཇིག་རྟེན་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_ དེས་ རྒྱ་མཚོ འི་ ཆུ་ལག་ དང་ བཅས་པ འི་ རྒྱ་མཚོ འི་ ནང་ གི་ ཀླུ འི་ གྲོང་ཁྱེར་ ལོངས་སྤྱོད་ ལྡན་ ཞེས་ བྱ་བ་ ལ་ བརྟགས་ ནས །_ རྒྱ་མཚོ འི་ གཏིང་ གི་ ས་གཞི་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $61 “As the monk who has knowledge of the effects of the ripening of karmic action continues to examine the world of the nāgas, he will examine the nāga city known as Endowed with Enjoyments, which is situated underneath the ocean.

source: རྒྱ་མཚོ འི་ གཏིང་ གི་ ས་གཞི་ ལ་ སུ་ དག་ གནས་ སྙམ་ ནས །_
en: As he examines the bottom of the sea, he wonders who might live there.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ ལྷ་ དང་ འགྲན་པ འི་ ལྷ་མ་ ཡིན་ ཞེས་ བྱ་བ་ དག་ གནས་ སོ །_།
en: $62 “As he investigates this with knowledge derived from hearing, the monk will see that this is the abode of the so-called asuras, who compete with the gods.

source: དེ་དག་ མདོ ར་ བསྡུ་ ན་ རྣམ་པ་ གཉིས་ ཏེ །_ ཡི་དགས་ ཀྱི་ འགྲོ་བ ར་ གཏོགས་པ་ རྣམས་ དང་ །_ དུད་འགྲོ འི་ འགྲོ་བ ར་ གཏོགས་པ་ རྣམས་ སོ །_།
en: These asuras are, briefly, of two kinds, because some belong to the class of starving spirits while others belong to the animal realm.

source: དེ་ ལ་ ཡི་དགས་ ཀྱི་ འགྲོ་བ ར་ གཏོགས་པ་ རྣམས་ ནི་ བདུད་ ཀྱི་ རིས་ ཀྱི་ ཡི་དགས་ རྣམས་ དང་ །_ ཡི་དགས་ རྫུ་འཕྲུལ་ ཆེན་པོ་ རྣམས་ སོ །_།
en: Those that belong to starving spirits are, moreover, either starving spirits of the māra class or starving spirits with great magical powers.

source: དུད་འགྲོ འི་ འགྲོ་བ ར་ གཏོགས་པ་ གང་ཡིན་པ་ དེ་དག་ ནི་ རྒྱ་མཚོ འི་ གཏིང་ གི་ ས་གཞི་ ལ་ གནས་ ཏེ །_ རི་རབ་ ཀྱི་ རྟེན་ དཔག་ཚད་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཡོད་པ འི་ ས འི་ འོག་ ན་ གནས་ སོ །_།
en: $63 “Those that belong to the animal realm live at the bottom of the sea, upon which rests the subterranean base of Mount Sumeru, which in total measures eighty-four thousand leagues.

source: དེ་དག་ ཀྱང་ མདོ ར་ བསྡུ་ ན །_ ས་གཞི་ བཞི་ ཡོད་ དོ །_། དེ་ ལ་ ས་གཞི་ དང་པོ་ ལ་ ནི་ དཔག་ཚད་ ཉི་ཁྲི་ གཅིག་ སྟོང་ ཡོད་ དེ །_ ས་གཞི་ དེ་ ན་ ནི་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ རྒྱལ་པོ་ སྒྲ་གཅན་ ཞེས་ བྱ་བ་ གནས་ སོ །_།
en: This mountain has four plateaus, of which the first measures twenty-one thousand leagues. $64 “On that first plateau resides Rāhu, king of the asuras, whose magical power to create forms exceeds that of anyone else within the desire realm.

source: དེས་ ནི་ འདོད་པ འི་ ཁམས་ སུ་ ཐམས་ཅད་ པས་ ལྷག་པ འི་ གཟུགས་ སྤྲུལ་ ནུས་ ལ་ མི་ རྣམས་ ཀྱི་ དགེ་བ་ དང་ མི་དགེ་བ འི་ དབང་ གིས་ དེ་ འདི་ སྙམ་ དུ་ [8a] སེམས་ ཏེ །_
en: Because of the virtues and vices of human beings, Rāhu [8.a] will think to himself, ‘The gods are rivals of us, the asuras.

source: བདག་ཅག་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ འགྲན་ཟླ་ ནི་ ལྷ་ རྣམས་ ཡིན་ གྱིས །_ བདག་ གིས་ དགྲ་ དེ་དག་ གི་ ཚལ་ དང་ །_ ནགས་ཚལ་ དང་ །_ ལྷ འི་ བུ་མོ་ གང་དག་ ལ་ ལྷ་ རྣམས་ རབ་ཏུ་ ཆགས་ ཤིང་ དགའ་བ ར་ འཛིན་པ་ དེ་དག་ བལྟ འོ་ སྙམ་ ནས
en: Let us go and have a look at those groves, forests, and divine maidens that the gods are so fond of and so attached to!’

source: དེས་ དེ་ལྟ ར་ བསམས་ ནས་ བདག་ཉིད་ ཀྱི་ ལུས་ བརྒྱན་ ཏེ་ ནོར་བུ འི་ རྒྱལ་པོ་ མཐོན་ཀ་ ཆེན་པོ འམ་ ནོར་བུ འི་ རྒྱལ་པོ་ པད་མ་ རཱ་ ག འམ །_ གསེར་ གྱི་ རྒྱལ་པོ་ ལམ་ མེ ར་ འདུག་པ འམ །_ དམར་ ལྔ འི་ རྒྱལ་པོ་ གསེར་ རམ །_ གོས་ ཀྱི་ རྒྱལ་པོ་ མ་ བཏགས་པ་ ཁ་དོག་ སྣ་ཚོགས་ སྔོན་པོ་ དང་ །_ དམར་པོ་ དང་ །_ སེར་པོ་ དང་ །_ ནག་པོ་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱེད་ ཅིང་ །_
en: $65 “With that thought in mind, Rāhu will adorn his body with precious gems such as sapphire and ruby, or with dazzling and pure royal gold, or with natural royal fabrics of blue, red, yellow, or black.

source: ནོར་བུ འི་ རྒྱལ་པོ་ གང་ རྒྱན་ དུ་ ཐོགས་པ་ དེ འི་ ཁ་དོག་ གིས་ སྒྲ་གཅན་ དེ འི་ ལུས་ ཀྱི་ ཚད་ ནི་ རི་རབ་ ཙམ་ ཡོད་པ་ དེ་ ཐམས་ཅད་ ནོར་བུ འི་ འོད་ དེ་ ཁོ་ན་ དང་ འདྲ་བ ར་ སྣང་བར་ འགྱུར་ ཏེ
en: Whichever precious stone Rāhu may choose as his adornment, it will make his entire body, which is as large as Mount Sumeru, shine with that same hue.

source: གལ་ཏེ་ མཐོན་ཀ་ ཆེན་པོ་ རྒྱན་ དུ་ ཐོགས་ ན་ ནི་ དེ འི་ ལུས་ ཐམས་ཅད་ མཆོག་ ཏུ་ སྔོན་པོ ར་ སྣང་བར་ འགྱུར་ རོ །_།
en: Thus, if he wears a great sapphire, his body will emit an awesome bluish light.

source: དམར་པོ་ ཡང་ དེ་ དང་ འདྲ འོ །_། སེར་པོ་ ཡང་ དེ་ དང་ འདྲ འོ །_། གལ་ཏེ་ སྤུག་ རྒྱན་ དུ་ ཐོགས་ ན་ ནི་ དེ འི་ ལུས་ ཐམས་ཅད་ ནོར་བུ་ དེ འི་ ཁ་དོག་ བཞིན་ དུ་ སྣང་བར་ འགྱུར་ རོ །_།
en: Likewise, he may also shine with a red or a yellow radiance, and if he adorns himself with coral, he will shine with the light of that gem.

source: ནོར་བུ་ གཞན་དག་ རྒྱན་ དུ་ ཐོགས་ ན་ ཡང་ །_ དེ་ དང་ དེ་བཞིན་ དུ་ དེ འི་ ཁ་དོག་ འདྲ་བ ར་ སྣང་བར་ འགྱུར་ རོ །_།
en: Whichever gem he may choose will lend him its radiance.

source: དེ་ ལྷ་ རྣམས་ ཀྱི་ འགྲན་ཟླ་ ཡིན་ ལ །_ ལྷ་མ་ ཡིན་ གྱི་ བུ་མོ་ རྣམས་ དང་ །_ ལྷ འི་ བུ་མོ་ རྣམས་ ནི་ རང་བཞིན་ གྱིས་ ཆགས་ སུ་ རུང་བ་ ཡིན་ ཏེ །_
en: In this fashion, he is able to compete with the gods and attract the attention of maidens among both the asuras and the gods.

source: དེ་དག་ ལ་ ཆགས་པ ར་ གྱུར་ ནས །_ སྒྲ་གཅན་ དེ་ ཕན་ཚུན་ འགྲོ་བ འི་ ཆས་ སུ་ ཞུགས་ ནས་ ས་གཞི་ དེ་ནས་ འབྱུང་ ངོ་ །_།
en: $66 “Wanting to meet the goddesses, Rāhu will put on his travel attire and then set forth from his abode.

source: སྒྲ་གཅན་ གྱི་ ས་གཞི་ དེ་ ན་ དེ འི་ གྲོང་ཁྱེར་ འོད་ཅན་ ཞེས་ བྱ་བ་ དཔག་ཚད་ བརྒྱ་ སྟོང་ ཡོད་པ་ རིན་པོ་ཆེ་ སྣ་ དུ་མ འི་ ཚལ་ དང་ །_ ནགས་ཚལ་ དང་ །_ ཤིང་ ལྗོན་པ་ དང་ །_ ཁང་ཁྱིམ་ དང་ །_ ལྟེང་ཀ་ དང་ །_ འབབ་ཆུ་ དང་ །_ རྫིང་ དང་ །_ ཆུ་ ཀ་ བདེ་བ་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ་ དེ འི་ ནང་ ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་ ལུས་ མེ་ཏོག་ གི་ ཕྲེང་བ་ དང་ །_ ཕྱེ་མ་ དང་ །_ སྤོས་ ཀྱི་ བྱུག་པ་ རྣམས་ ཀྱིས་ བརྒྱན་ ཏེ་ བྱུང་ ནས དེ་ ལྷ་ རྣམས་ ཀྱི་ ཚལ་ དང་ །_ ནགས་ཚལ་ རྣམས་ ལ་ ལྟ་བ ར་ བྱེད་ དོ །_།
en: He will make his way into his city, which is known as Radiant. Spanning a hundred thousand leagues, this city is adorned with delightful groves, forests, trees, mansions, ponds, fountains, pools, and spouts that are all made of jewels. The lord of the asuras, who is adorned with flower garlands, powders, and ointments, will then leave this city to inspect the groves and forests of the gods.

source: དེ་ལྟ་ ཞིང་ འདུག་པ་ ན་ གལ་ཏེ་ འཛམ་བུ འི་ གླིང་ གི་ མི་ རྣམས་ ཆོས་མ་ ཡིན་པ་ ལ་ ཞུགས་ ཏེ །_ ཕ ར་ མི་ [8b] འཛིན་པ་ དང་ །_ མར་ མི་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ མི་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ མི་ འཛིན་པ་ དང་ །_ རང་ གི་ ཕ་ཚན་ གྱི་ ནང་ ན་ རྒན་རབས་ ཀྱི་ རིམ་པ་ མེད་པ་ དང་ །_ ཆོས་ ལ་ མི་ རྟེན་པ་ དང་ །_ དཀོན་མཆོག་ གསུམ་ ལ་ མཆོད་པ་ མི་ བྱེད་པ་ དང་ །_ དགེ་བ་ དང་ མི་དགེ་བ འི་ ལས་ ལ་ མི་ལྟ་བ ར་ གྱུར་ ན་ ནི །_ དེ འི་ ཚེ་ ས་ ཐ་མ་ ལ་ གནས་པ་ རྒྱལ་ཆེན་ བཞི འི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ མཐུ་ ཆུང་བ ར་ འགྱུར་ ཏེ
en: $67 “If at that time the humans in Jambudvīpa pursue non-Dharma—if they do not respect their fathers, [8.b] mothers, mendicants, or brahmins; if they do not maintain the traditions of their paternal ancestors; or if they do not rely on the Dharma, worship the Three Jewels, or take care regarding virtuous and unvirtuous actions—then the gods of the Four Great Kings, who inhabit the lowest of the divine abodes, will feel their power diminish.

source: གཅིག་ གིས་ གཅིག་ བསོགས་ ནས་ ཀྱེ་ ལྷ་ རྣམས་ སེང་གེ་ མོ འི་ བུ་ སྒྲ་གཅན་ ནི་ བདག་ཅག་ བསད་པ འི་ ཕྱིར་ བཏུལ་ ཏེ་ བྱུང་ ངོ་ ཞེས་ འཛེར་ ཏོ །_།
en: Alarmed, they will shout to each other, ‘O gods, the son of the lioness, Rāhu, has come to subdue and kill us!’

source: གང་ གི་ ཚེ་ འཛམ་བུ འི་ གླིང་ གི་ མི་ རྣམས་ ཆོས་ དང་ ལྡན་པ ར་ གྱུར་ ཏེ །_ ཕ ར་ འཛིན་པ་ དང་ །_ མར་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ་ དང་ །_ རང་ གི་ ཕ་ཚན་ གྱི་ ནང་ ན་ རྒན་རབས་ ཀྱི་ རིམ་པ་ ཡོད་པ་ དང་ །_
en: $68 “However, if at that time the humans in Jambudvīpa are righteous—if they respect their fathers, their mothers, mendicants, and brahmins; if they maintain the traditions of their paternal ancestors;

source: ཆོས་ ལ་ རྟེན་པ་ དང་ །_ དཀོན་མཆོག་ གསུམ་ ལ་ མཆོད་པ་ བྱེད་པ་ དང་ །_ དགེ་བ་ དང་ །_ མི་དགེ་བ འི་ ལས་ ལ་ ལྟ་བ ར་ གྱུར་ ན་ ནི །_ དེ འི་ ཚེ་ ས་ ཐ་མ་ ལ་ གནས་པ་ རྒྱལ་ཆེན་ བཞི འི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ རིན་པོ་ཆེ་ སྣ་ཚོགས་ བླངས་ ནས ལུས་ བརྒྱན །_ ཆ་ལུགས་ སྣ་ཚོགས་ སུ་ ཆ་ ཞིང་ །_ ལུས་ མེ་ཏོག་ གི་ ཕྲེང་བ་ དང་ །_ ཕྱེ་མ་ དང་ །_ སྤོས་ ཀྱི་ བྱུག་པ་ རྣམས་ ཀྱིས་ བརྒྱན་ ཏེ །_
en: and if they rely on the Dharma, worship the Three Jewels, and take care regarding virtuous and unvirtuous actions—then the gods of the Four Great Kings will proceed to dress up in their various jewels, adorn their bodies with numerous ornaments and garments, drape themselves with flower garlands, and apply colored powders and fragrant ointments.

source: མཚོན་ཆ་ སྣ་ཚོགས་ ཀྱི་ ཆར་ འབེབས་ ལ །_ ཧ་ ཧ་ ཞེས་ བྱ་བ འི་ སྒྲ་ སྒྲོགས་ ཤིང་ རི་རབ་ ཀྱི་ ཁོང་ ན་ ཚལ་ དང་ །_ ནགས་ཚལ་ གང་ ན་ སེང་གེ་ མོ འི་ བུ་ སྒྲ་གཅན་ འདུག་པ་ དེ་དག་ ཏུ་ རྒྱུག་ གོ །_།
en: They will then let a rain of weapons fall, and, with a roar of laughter, hasten to the groves and forests on Mount Sumeru where the son of the lioness, Rāhu, is now present.

source: དེ་སྟེ་ དེ་ མི་ རྒལ་ ན་ ནི་ རི་རབ་ ཀྱི་ ངོས་ ལ་ ཚལ་ དང་ ནགས་ཚལ་ འདུག་པ་ དག་ ལ་ ཉི་མ འི་ ཟེར་ གྱིས་ ཕོག་པ འི་ འོད་ཟེར་ འབུམ་ཕྲག་ མང་པོ་ དེ འི་ གདོང་ དུ་ བབ་ སྟེ མིག་ ལ་ གནོད་པ ར་ གྱུར་པ་ མཐོང་ ངོ་ །_།
en: $69 “While Rāhu is still in the groves and forests on the slopes of Mount Sumeru, he will feel millions of light rays strike his face and impair his vision.

source: དེས་ ཉི་མ འི་ ཟེར་ དེ་ མཐོང་ ནས །_ ཉི་མ འི་ ཟེར་ གྱིས་ མིག་ འཁྲུགས་ ཏེ །_ ཉི་མ འི་ ལན་ གྱིས་ ལྷ འི་ བུ་མོ་ རྣམས་ ཀྱང་ བལྟ་བ ར་ མ་ནུ ས །_ ལྷ འི་ ཚལ་ དང་ །_ ནགས་ཚལ་ རྣམས་ དང་ །_ རྫིང་ རྣམས་ དང་ །_ ལྷ འི་ འབྱོར་པ་ རྣམས་ ཀྱང་ བལྟ་བ ར་ མ་ནུ ས་ སྙམ་ ནས
en: Unable to see and with his eyes aching, he will think, ‘It is the sun’s fault that I cannot see the divine maidens or the groves, forests, ponds, or riches of the gods!’

source: དེས་ བསམས་པ །_ ཀྱེ་མ་ ཉི་མ འི་ ལན་ གྱིས་ ལྷ འི་ བུ་མོ་ རྣམས་ བདག་ གིས་ བལྟ་བ ར་ མ་ནུ ས་ སོ་ སྙམ་ སྟེ །_ ཁྲོས་པ ས་ མིག་ རྩ་ དམར་པོ ར་ གྱུར་ ཅིང་ །_ ལག་པ ས་ ཉི་མ འི་ [9a] དཀྱིལ་འཁོར་ སྒྲིབ་པ ར་ བྱེད་ དོ །_།
en: Angry and red-eyed, he will think, ‘Because of the sun I cannot see the goddesses!’ and so he will block out the sunlight with his hand. [9.a]

source: དེས་ ཉི་མ འི་ དཀྱིལ་འཁོར་ ལག་པ ས་ བསྒྲིབས་ ནས །_ དེ་ བདག་ གིས་ ལྷ་མོ་ རྣམས་ དང་ །_ མཐོ་རིས་ བལྟ འོ་ སྙམ་ སྟེ །_ མདོག་ སྡུག་ ཅིང་ ཡིད་ དུ་ འོང་བ་ བལྟ་བ་ ལ་རྩེ་ ཚུགས་ སུ་ འདུད་ དོ །_།
en: While blocking the sun with his hand, Rāhu will think, ‘I want to see the goddesses and the heavens!’ and so he will eagerly and earnestly try to see those beautiful sights.

source: དེ་ནས་ རྒྱ་མཚོས་ ནི་ དེ འི་ རྐེད་པ ར་ ཕྱིན་ ལ །_ སྔ་མ་ བཞིན་ དུ་ ནོར་བུ འི་ རྒྱན་ ཇི་ལྟ་བུ་ ཐོགས་པ་ དེ་ལྟ་ བུ འི་ ཁ་དོག་ གིས་ རྐེད་པ་ ཡན་ཆད་ ཁྱབ་པ ར་ འདུག་ སྟེ །_
en: $70 “As he stands there, the ocean will reach to his waist, but his jewel ornaments will still saturate everything above his waist with their colors.

source: ནོར་བུ འི་ འོད་ ཀྱིས་ ལག་པ་ སྔོན་པོ འམ །_ དམར་པོ འམ །_ སེར་པོ འམ །_ ནག་པོ ར་ གྱུར་ ཏེ །_
en: Thus, as he stands there blocking the harmful sunlight, the light from his jewels will make his hand blue, red, yellow, or black.

source: ལག་པ ས་ ཉི་མ འི་ ཟེར་ གྱི་ གནོད་པ་ བསྒྲིབས་པ་ དེ་ བྲམ་ཟེ་ རྟོག་གེ་པ་ ལོག་པ འི་ ཐོས་པ ས་ བསླུས་པ་ རྣམས་ ཀྱིས་ མཐོང་ ནས །_
en: When brahmin pundits, who are deceived by incorrect learning, see this, they will say,

source: ཉི་མ་ གཟའ་ སྡིག་ཅན་ གྱིས་ ཟིན་ ཏོ །_།
en: ‘The sun has been taken by an evil planet!

source: ཉི་མ་ གཟའ་ དམར་པོ ས་ ཟིན་ ཏོ །_།
en: The sun has been taken by a red planet!

source: ཉི་མ་ གཟའ་ སེར་པོ ས་ ཟིན་ ཏོ །_།
en: The sun has been eclipsed by a yellow planet!

source: ཉི་མ་ གཟའ་ ནག་པོ ས་ ཟིན་ ཏོ་
en: The sun has been eclipsed by a black planet!’

source: ཞེས་ ཟེར་ ཞིང་ལས་ དང་ འབྲས་བུ་ རྒྱབ་ ཏུ་ བོར་ ནས་ དེ་ལྟ་ བུས་ འཚོ་བ་ ཚོལ་བ འི་ ཕྱིར །_ འདི་ལྟར་ ལོ་ལེགས་ པར་ འགྱུར་ རོ །_། ལོ་ཉེས་ པར་ འགྱུར་ རོ །_། རྒྱལ་པོ་ ལ་ རུང་བ ར་ འགྱུར་ རོ །_། རྒྱལ་པོ་ ལ་ མི་ རུང་བ ར་ འགྱུར་ རོ །_། ལྟས་བཟང་ ངོ་ །_། ལྟས་ངན་ པར་ འགྱུར་ རོ་ ཞེས་ རྟོག་གེ འི་ རིག་པས་ སྟོན་པ ར་ བྱེད་ དོ །_།
en: Harboring disregard for the consequences of actions and seeking to make a living, such people will proceed to make prognostications that this eclipse means harvests will be either good or bad, that the king will have either success or failure, or that this is either an auspicious or an inauspicious sign.

source: ཡང་དག་ པར་ ན་ ནི་ དེས་ ཉི་མ་ ལག་པ ས་ བསྒྲིབས་ ནས་ ལྷ འི་ འཇིག་རྟེན་ ཚལ་ དང་ །_ ནགས་ཚལ་ དང་ །_ ལྟེང་ཀ་ དང་ །_ རིན་པོ་ཆེ ས་ མཛེས་པ ར་ བྱས་པ་ དང་ བཅས་པ་ བདེ་བླག་ ཏུ་ ལྟ་བ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: In fact, this is just Rāhu blocking the sun with his hand as he seeks to better see the divine forests, groves, pools, and jeweled beauties.

source: དེ་ནས་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱིས་ དེ་ མཐོང་ ནས་ ལྷ་ རྣམས་ ལ་ ང འི་ ཤིང་རྟ་ སྔོན་ དུ་ ཐོང་ ལ །_ སྒྲ་གཅན་ འདི་ ཟློག་ ཤིག་ ཅེས་ བསྒོའོ །_།
en: $71 “When Śakra, lord of the gods, sees this, he will summon the gods and order them, ‘Send forth my chariot and drive back this Rāhu!’

source: དེ་ནས་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱིས་ བསྒོ་བ་ བཞིན་ དུ་ ལྷ་ རྣམས་ ལུས་ རིན་པོ་ཆེ་ སྣ་ཚོགས་ ཀྱིས་ བརྒྱན་ ཏེ སེང་གེ་ མོ འི་ བུ་ སྒྲ་གཅན་ ག་ལ་བ་ དེར་ ཐབ་མོ་ བྱ་བ འི་ ཕྱིར་ རྒྱུག་ གོ །_།
en: Heeding Śakra’s command, the gods will adorn their bodies with numerous jewels and race forth to meet the son of the lioness, Rāhu, in battle.

source: དེ་ནས་ དེས་ ལྷ་ དེ་ རྣམས་ མཐོང་ ནས་ ཕྱིར་ རང་ གི་ གནས་ སུ་ འགྲོ་བ ར་ འགྱུར་ རོ་
en: As Rāhu then beholds the advancing gods, he will retreat to his own realm.
